pwbf/RX64M_Vibration/src/r_t4_dns_client_rx/src/r_dns_client.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2011 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_dns_client.c
* Version      : 1.0
* Device(s)    : any
* Tool-Chain   : any
* OS     : any
* H/W Platform : any
* Description  : This is the dns client code.
* Operation    :
* Limitations  :
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version  Description
*               : 04.04.2011 1.00    First Release
*               : 27.05.2014 1.01    Corresponded to Non-blocking call.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include <string.h>
#include <stdint.h>
#include "r_t4_itcpip.h"
#include "r_t4_dns_client_rx_config.h"
#include "r_t4_dns_client_rx_if.h"
#include "r_dns_client.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Exported global variables (to be accessed by other files)
***********************************************************************************************************************/
uint8_t dnsaddr1[] = {DNS_IP_ADDR_1};
uint8_t dnsaddr2[] = {DNS_IP_ADDR_2};

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
static uint8_t dns_buffer[512];
static DNS_PACKET dns_packet;
static uint16_t TRANSACTION_ID = 0;

static const uint8_t *dnsaddr_tbl[DNS_SELECT_NUM] =
{
    (const uint8_t *)&dnsaddr1,
    (const uint8_t *)&dnsaddr2
};

NAME_TABLE name_table;
DNS_MNG  dns_mng;

static int32_t dns_dummy_proc(void);
static int32_t dns_no_proc(void);
static int32_t dns_proc_A1(void);
static int32_t dns_proc_B2(void);
static int32_t dns_proc_C2(void);
static int32_t dns_proc_D2(void);
static int32_t dns_proc_D3(void);
static int32_t dns_proc_D6(void);
static int32_t dns_proc_E2(void);
static int32_t dns_proc_E4(void);
static int32_t dns_proc_F2(void);
static int32_t dns_proc_G2(void);
static int32_t dns_proc_H2(void);
static int32_t dns_proc_H5(void);
static int32_t dns_proc_I2(void);

static const DNS_PROC_FUNC dns_proc_table[DNS_PROC_NUM][DNS_EVENT_NUM] =
{
    /* A.unreceived request    */
    {
        dns_proc_A1,       /* 1.received request    */
        dns_no_proc,       /* 2.periodic       */
        dns_dummy_proc,    /* 3.complete sending callback  */
        dns_no_proc,       /* 4.complete receiving callback */
        dns_dummy_proc,    /* 5.complete canceling callback */
        dns_dummy_proc     /* 6.send ARP timeout callback  */
    },
    /* B.initial      */
    {
        dns_dummy_proc,    /* 1.received request    */
        dns_proc_B2,       /* 2.periodic       */
        dns_dummy_proc,    /* 3.complete sending callback  */
        dns_no_proc,       /* 4.complete receiving callback */
        dns_dummy_proc,    /* 5.complete canceling callback */
        dns_dummy_proc     /* 6.send ARP timeout callback  */
    },
    /* C.start sending    */
    {
        dns_dummy_proc,    /* 1.received request    */
        dns_proc_C2,       /* 2.periodic       */
        dns_dummy_proc,    /* 3.complete sending callback  */
        dns_no_proc,       /* 4.complete receiving callback */
        dns_dummy_proc,    /* 5.complete canceling callback */
        dns_dummy_proc     /* 6.send ARP timeout callback  */
    },
    /* D.wait to complete sending request */
    {
        dns_dummy_proc,    /* 1.received request    */
        dns_proc_D2,       /* 2.periodic       */
        dns_proc_D3,       /* 3.complete sending callback  */
        dns_no_proc,       /* 4.complete receiving callback */
        dns_dummy_proc,    /* 5.complete canceling callback */
        dns_proc_D6        /* 6.send ARP timeout callback  */
    },
    /* E.wait to complete receiveing request*/
    {
        dns_dummy_proc,    /* 1.received request    */
        dns_proc_E2,       /* 2.periodic       */
        dns_dummy_proc,    /* 3.complete sending callback  */
        dns_proc_E4,       /* 4.complete receiving callback */
        dns_dummy_proc,    /* 5.complete canceling callback */
        dns_dummy_proc     /* 6.send ARP timeout callback  */
    },
    /* F.finish       */
    {
        dns_dummy_proc,    /* 1.received request    */
        dns_proc_F2,       /* 2.periodic       */
        dns_dummy_proc,    /* 3.complete sending callback  */
        dns_no_proc,       /* 4.complete receiving callback */
        dns_dummy_proc,    /* 5.complete canceling callback */
        dns_dummy_proc     /* 6.send ARP timeout callback  */
    },
    /* G.cancelling      */
    {
        dns_dummy_proc,    /* 1.received request    */
        dns_proc_G2,       /* 2.periodic       */
        dns_dummy_proc,    /* 3.complete sending callback  */
        dns_no_proc,       /* 4.complete receiving callback */
        dns_dummy_proc,    /* 5.complete canceling callback */
        dns_dummy_proc     /* 6.send ARP timeout callback  */
    },
    /* H.wait to complete cancelling */
    {
        dns_dummy_proc,    /* 1.received request    */
        dns_proc_H2,       /* 2.periodic       */
        dns_dummy_proc,    /* 3.complete sending callback  */
        dns_no_proc,       /* 4.complete receiving callback */
        dns_proc_H5,       /* 5.complete canceling callback */
        dns_dummy_proc     /* 6.send ARP timeout callback  */
    },
    /* I.cancelled      */
    {
        dns_dummy_proc,    /* 1.received request    */
        dns_proc_I2,       /* 2.periodic       */
        dns_dummy_proc,    /* 3.complete sending callback  */
        dns_no_proc,       /* 4.complete receiving callback */
        dns_dummy_proc,    /* 5.complete canceling callback */
        dns_dummy_proc     /* 6.send ARP timeout callback  */
    }
};

static int32_t dns_dummy_proc(void)
{
    while (1); /* System Error!! */

    return E_SYS;
}

static int32_t dns_no_proc(void)
{
    /* None */

    return E_OK;
}

static int32_t dns_proc_A1(void)
{
    dns_mng.proc = DNS_PROC_INIT;    /* proc <- B.initial */

    return E_OK;
}

