pwbf/RX64M_Vibration/src/r_t4_dns_client_rx/src/r_dns_client.c
static int32_t dns_proc_B2(void)
{
    dns_mng.proc = DNS_PROC_START_SENDING; /* proc <- C.start sending */

    return E_OK;
}

static int32_t dns_proc_C2(void)
{
    int32_t  ercd;
    uint32_t dstaddr;

    ercd = E_OK;
    dstaddr = convert_array_to_long((uint8_t *)dnsaddr_tbl[dns_mng.dns_select]);

    reset_timer();
    ercd = send_dns_request(dns_mng.name, dstaddr);

    if (E_WBLK == ercd)
    {
        dns_mng.proc = DNS_PROC_SENDING_REQUEST_WAIT; /* proc <- D.wait to complete sending request */
    }
    else /* if (E_WBLK == ercd) */
    {
        dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */
        dns_mng.retry_cnt = 0;     /* no retry */
    }

    return ercd;
}

static int32_t dns_proc_D2(void)
{
    int32_t  ercd;
    uint16_t timer;

    ercd = E_OK;
    timer = get_timer();

    if (DNS_TIMEOUT < timer)
    {
        dns_mng.proc = DNS_PROC_CANCELLING;  /* proc <- G.cancelling */
        ercd = E_DNS_INTERNAL;
    }
    return ercd;
}

static int32_t dns_proc_D3(void)
{
    reset_timer();
    dns_mng.proc = DNS_PROC_RECEIVEING_REQUEST_WAIT; /* proc <- E.wait to complete receiveing request */

    return E_OK;
}

static int32_t dns_proc_D6(void)
{
    dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */
    dns_mng.retry_cnt = 0;     /* no retry */

    return E_DNS_INTERNAL;
}

static int32_t dns_proc_E2(void)
{
    int32_t  ercd;
    uint16_t timer;

    ercd = E_OK;
    timer = get_timer();

    if (DNS_TIMEOUT < timer)
    {
        dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */
        ercd = E_DNS_INTERNAL;
    }
    return ercd;
}

static int32_t dns_proc_E4(void)
{
    int32_t ercd;

    clear_table(&name_table);
    ercd = receive_dns_response(&name_table);

    if (0 <= ercd)
    {
        dns_mng.proc = DNS_PROC_FINISH;   /* proc <- F.finish */
        ercd = E_OK;
    }
    else /* if (0 <= ercd) */
    {
        dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */
        dns_mng.retry_cnt = 0;     /* no retry */
        ercd = E_DNS_INTERNAL;
    }

    return ercd;
}

static int32_t dns_proc_F2(void)
{
    int32_t ercd;

    ercd = E_OK;

    if (NULL != dns_mng.cb_func)
    {
        dns_mng.cb_func(ercd, &name_table);
    }

    dns_mng.proc = DNS_PROC_UNRECEIVED_REQUEST;  /* proc <- A.unreceived request */

    return ercd;
}

static int32_t dns_proc_G2(void)
{
    int32_t ercd;

    ercd = E_OK;
    reset_timer();

    ercd = udp_can_cep(dns_mng.cepid, TFN_UDP_ALL);

    if (E_OK == ercd)
    {
        dns_mng.proc = DNS_PROC_CANCELLING_WAIT; /* proc <- H.wait to complete cancelling */
    }
    else /* H.wait to complete cancelling */
    {
        dns_mng.proc = DNS_PROC_UNRECEIVED_REQUEST;  /* proc <- A.unreceived request */

        if (NULL != dns_mng.cb_func)
        {
            dns_mng.cb_func(ercd, NULL);
        }
    }
    return ercd;
}

static int32_t dns_proc_H2(void)
{
    int32_t  ercd;
    uint16_t timer;

    ercd = E_OK;
    timer = get_timer();

    if (DNS_TIMEOUT < timer)
    {
        dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */
        dns_mng.retry_cnt = 0;     /* no retry */
        ercd = E_DNS_INTERNAL;
    }
    return ercd;
}

static int32_t dns_proc_H5(void)
{
    dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */

    return E_OK;
}

static int32_t dns_proc_I2(void)
{
    int32_t ercd;

    ercd = E_OK;

    if (dns_mng.retry_cnt > 0)
    {
        dns_mng.retry_cnt--;
        dns_mng.proc = DNS_PROC_START_SENDING; /* proc <- C.start sending */
    }
    else /* if (dns_mng.retry_cnt > 0) */
    {
        if (DNS_SELECT_PRIMARY == dns_mng.dns_select)
        {
            dns_mng.dns_select = DNS_SELECT_SECONDARY;
            dns_mng.retry_cnt = DNS_ERROR_COUNT;
            dns_mng.proc = DNS_PROC_START_SENDING; /* proc <- C.start sending */
        }
        else /* if (DNS_SELECT_PRIMARY == dns_mng.dns_select) */
        {
            ercd = E_DNS_TIMEOUT;
            dns_mng.proc = DNS_PROC_UNRECEIVED_REQUEST;  /* proc <- A.unreceived request */

            if (NULL != dns_mng.cb_func)
            {
                dns_mng.cb_func(ercd, NULL);
            }
        }
    }
    return ercd;
}

/***********************************************************************************************************************
* Function Name: R_dns_init
* Description  : Initialize DNS management variables
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
void R_dns_init(void)
{
    dns_mng.proc = DNS_PROC_UNRECEIVED_REQUEST;        /* proc <- A.unreceived request   */
    dns_mng.dns_select = DNS_SELECT_PRIMARY;           /* selected dns server <- primary */
    dns_mng.cb_func = NULL;                            /* callback function <- NULL      */
    memset(&dns_mng.name[0], 0, sizeof(dns_mng.name)); /* domain name <- all '\0'        */
    dns_mng.retry_cnt = DNS_ERROR_COUNT;               /* Initialize retry counter       */
    dns_mng.cepid = 0;                                 /* invalid ID                     */
}

/***********************************************************************************************************************
* Function Name: R_dns_resolve_name
* Description  : Setting the domain name you want to resolve
* Arguments    : name -
*                    address of domain name
*                func -
*                    callback function
* Return Value : error code
***********************************************************************************************************************/
int32_t R_dns_resolve_name(char *name, DNS_CB_FUNC func)
{
    int32_t ercd;

    ercd = E_OK;

    if (DNS_PROC_UNRECEIVED_REQUEST == dns_mng.proc)
    {
        R_dns_init();

        dns_mng.cepid = DNS_UDP_CEP_ID;
        strncpy(&dns_mng.name[0], name, sizeof(dns_mng.name));
        dns_mng.cb_func = func;

        if (dns_mng.proc < DNS_PROC_NUM)
        {
            ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_RECEIVED_REQUEST]();
        }
        else /* if (dns_mng.proc < DNS_PROC_NUM) */
        {
            while (1); /* System Error!! */
        }
    }
    else /* if (DNS_PROC_UNRECEIVED_REQUEST == dns_mng.proc) */
    {
        ercd = E_DNS_PROCESSING;
    }
    return ercd;
}

