pwbf/RX64M_Vibration/src/r_t4_dns_client_rx/src/r_dns_client.c
/***********************************************************************************************************************
* Function Name: R_dns_process
* Description  : DNS client main process.
*                This function must be called periodic.
* Arguments    : none
* Return Value : error code
***********************************************************************************************************************/
int32_t R_dns_process(void)
{
    int32_t ercd;

    ercd = E_OK;

    if (dns_mng.proc < DNS_PROC_NUM)
    {
        ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_PERIODIC]();
    }
    else /* if (dns_mng.proc < DNS_PROC_NUM) */
    {
        while (1); /* System Error!! */
    }

    return ercd;
}

/***********************************************************************************************************************
* Function Name: dns_callback
* Description  : DNS callback function
* Arguments    : cepid -
*                    the communication endpoint ID
*                fncd -
*                    function code
*                p_parblk -
*                    error code pointer
* Return Value : error code
***********************************************************************************************************************/
ER dns_callback(ID cepid, FN fncd , VP p_parblk)
{
    ER parblk;
    ER ercd;

    parblk = *(ER *)p_parblk;
    ercd   = E_OK;

    /* cepid is 1 fixed */
    if (dns_mng.cepid != cepid)
    {
        while (1); /* System Error!! */
    }

    if (DNS_PROC_NUM < dns_mng.proc)
    {
        while (1); /* System Error!! */
    }

    switch (fncd)
    {
        case TFN_UDP_SND_DAT:
            if (0 < parblk)    /* completed sending */
            {
                ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_CALLBACK_SEND]();
            }
            else if (E_CLS == parblk) /* send ARP timeout */
            {
                ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_CALLBACK_SEND_ARP_TIMEOUT]();
            }
            else if (E_RLWAI == parblk)
            {
                ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_CALLBACK_CANCEL]();
            }
            else      /* default */
            {
                /* None */
            }
            break;

        case TEV_UDP_RCV_DAT:
            if (0 < parblk)    /* completed receving */
            {
                ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_CALLBACK_RECEIVE]();
            }
            break;

        default:
            /* None */
            break;
    }
    return ercd;
}

static int32_t send_dns_request(char *name, uint32_t dstaddr)
{
    static T_IPV4EP dns;
    int32_t ercd;

    dns.ipaddr = dstaddr;
    dns.portno = 53;

    dns_packet.header.ID       = htons(TRANSACTION_ID);
    dns_packet.header.Flag     = htons(0x0100);
    dns_packet.header.QDCOUNT  = htons(1);
    dns_packet.header.ANCOUNT  = htons(0);
    dns_packet.header.NSCOUNT  = htons(0);
    dns_packet.header.ARCOUNT  = htons(0);

    memcpy(dns_buffer, &dns_packet.header, sizeof(dns_packet.header));

    dns_packet.question.QNAME   = name;
    dns_packet.question.QTYPE   = htons(0x0001);
    dns_packet.question.QCLASS  = htons(0x0001);

    convert_name_to_dns_query((char*)&dns_buffer[sizeof(dns_packet.header)], name);

    dns_buffer[sizeof(dns_packet.header)+strlen((char*)name)+1]  = 0;

#if defined(__BIG)
    dns_buffer[sizeof(dns_packet.header)+strlen((char*)name)+2]  = ((dns_packet.question.QTYPE & 0xff00) >> 8);
    dns_buffer[sizeof(dns_packet.header)+strlen((char*)name)+3]  = (dns_packet.question.QTYPE & 0x00ff);
    dns_buffer[sizeof(dns_packet.header)+strlen((char*)name)+4]  = ((dns_packet.question.QCLASS & 0xff00) >> 8);
    dns_buffer[sizeof(dns_packet.header)+strlen((char*)name)+5]  = (dns_packet.question.QCLASS & 0x00ff);
#else
    dns_buffer[sizeof(dns_packet.header)+strlen((char*)name)+3]  = ((dns_packet.question.QTYPE & 0xff00) >> 8);
    dns_buffer[sizeof(dns_packet.header)+strlen((char*)name)+2]  = (dns_packet.question.QTYPE & 0x00ff);
    dns_buffer[sizeof(dns_packet.header)+strlen((char*)name)+5]  = ((dns_packet.question.QCLASS & 0xff00) >> 8);
    dns_buffer[sizeof(dns_packet.header)+strlen((char*)name)+4]  = (dns_packet.question.QCLASS & 0x00ff);
#endif

    ercd = udp_snd_dat(1, &dns, dns_buffer, sizeof(dns_packet.header) + strlen((char*)name) + 6, TMO_NBLK);

    return ercd;

}


static int32_t receive_dns_response(NAME_TABLE *table)
{

    T_IPV4EP dstaddr;
    int32_t receive_data_len = 0;
    uint16_t answer_offset = 0;
    int32_t query_size = 0;
    uint8_t answer_count = 0;
    uint8_t answer_check_count = 0;
    uint16_t answer_size = 0;
    uint8_t query_type = 0;

    receive_data_len = udp_rcv_dat(1, &dstaddr, dns_buffer, 512 , TMO_POL);

    if (receive_data_len < 0)
    {
        return -1;
    }

    memcpy(&dns_packet.header, dns_buffer, sizeof(dns_packet.header));

    answer_count = answer_check_count = htons(dns_packet.header.ANCOUNT);
    if (answer_count > DNS_BUFFER_COUNT)
    {
        answer_count = answer_check_count = DNS_BUFFER_COUNT;
    }
    else if (answer_count == 0)
    {
        return -1;
    }
    else
    {

    }

    if (dns_packet.header.ID != htons(TRANSACTION_ID++))
    {
        return -1;
    }

    if (!(dns_packet.header.Flag & htons(0x8000)))  // Response Bit(1) : Message is a response
    {
        return -1;
    }

    if (dns_packet.header.Flag & htons(0x7800))   // Op Code(0000) : Standard query
    {
        return -1;
    }

    if (dns_packet.header.Flag & htons(0x000f))   // Reply Code(0000) : No error
    {
        return -1;
    }

    query_size = check_query((char*) & dns_buffer[sizeof(dns_packet.header)]);
    if (query_size < 0)
    {
        return -1;
    }
    answer_offset = query_size + sizeof(dns_packet.header);

    while (answer_check_count)
    {
        answer_size = check_answer((char*) & dns_buffer[answer_offset], (char*)dns_buffer, table, &query_type);
        answer_offset += answer_size;
        if (query_type == QUERY_TYPE_A)
        {
            answer_check_count--;
        }
    }

