pwbf/RX64M_Vibration/src/r_t4_dns_client_rx/src/r_dns_client.c
    return 0;
}

uint32_t convert_array_to_long(uint8_t *ipaddr)
{
    uint32_t tmp = 0;

    tmp = ((((uint32_t)ipaddr[0]) << 24) & 0xFF000000);
    tmp |= ((((uint32_t)ipaddr[1]) << 16) & 0x00FF0000);
    tmp |= ((((uint32_t)ipaddr[2]) << 8)  & 0x0000FF00);
    tmp |= (((uint32_t)ipaddr[3])      & 0x000000FF);

    return tmp;
}

static int32_t convert_name_to_dns_query(char *query, char *name)
{
    uint8_t count = 0;
    uint8_t loop_counter = 0;
    uint8_t label_cnt = 0;
    uint8_t name_len = strlen((char*)name);

    memcpy(query + 1, name, strlen((char*)name));

    while (loop_counter < name_len)
    {
        if (*name++ == '.')
        {
            *query = label_cnt;
            query += label_cnt + 1;
            label_cnt = 0;
        }
        else
        {
            label_cnt++;
        }
        loop_counter++;
    }

    *query = label_cnt;

    return count;
}

static int32_t check_query(char *query)
{
    char *check = query;

    while (*query != 0x00)
    {
        query += *query + 1;
        if ((query - check) > 0xff)
        {
            return -1;
        }
    }
    return ((query + 5) - check);

}

static int32_t check_answer(char *answer, char *dns_response, NAME_TABLE *table, uint8_t *query_type)
{

    uint16_t src_offset = 0;
    uint16_t answer_length = 0;
    uint16_t query_length = 0;

    if ((*answer & 0xc0) == 0xc0)
    {
        switch (answer[3])
        {

            case QUERY_TYPE_A:
                src_offset = (*answer & ~0xc0) << 8;
                src_offset |= *(answer + 1);

                query_length = get_name_till_stringend(&dns_response[src_offset], dns_response, table);

                memcpy(table->ipaddr, &answer[12], 4);
                answer_length = 16;
                *query_type = QUERY_TYPE_A;
                break;

            case QUERY_TYPE_CNAME:
                table->name[0] = 0;
                answer_length = answer[11] + 12;
                *query_type = QUERY_TYPE_CNAME;
                break;

            default:
                *query_type = QUERY_TYPE_UNKNOWN;
                break;
        }
    }
    else
    {
        query_length = get_name_till_stringend(answer, dns_response, table);

        switch (answer[query_length + 2])
        {
            case QUERY_TYPE_A:
                memcpy(table->ipaddr, &answer[query_length + 11], 4);
                answer_length = 15 + query_length;
                *query_type = QUERY_TYPE_A;
                break;

            case QUERY_TYPE_CNAME:
                table->name[0] = 0;
                answer_length = answer[query_length + 10] + query_length + 11;
                *query_type = QUERY_TYPE_CNAME;
                break;

            default:
                *query_type = QUERY_TYPE_UNKNOWN;
                break;
        }
    }
    return answer_length;
}

static int32_t get_name_till_stringend(const char *string, const char *dns_response, NAME_TABLE *table)
{
    uint16_t dst_offset = 0;
    uint16_t src_offset = 0;
    uint16_t next_offset = 0;

    while (string[src_offset] != 0x00)
    {
        if (strlen(table->name) > NAME_SIZE)
        {
            return -1;
        }
        if ((string[src_offset] & 0xc0) == 0xc0)
        {
            next_offset = (string[src_offset] & ~0xc0) << 8;
            next_offset |= (string[src_offset + 1]);
            dst_offset += get_name_till_stringend(&dns_response[next_offset], dns_response, table);

            while ((string[src_offset] & 0xc0) == 0xc0)
            {
                src_offset += 2;
                if (src_offset > NAME_SIZE)
                {
                    return -1;
                }
            }
        }

        else
        {
            strncat((char*)table->name, (char*)&string[src_offset+1], string[src_offset]);
            dst_offset += string[src_offset] + 1;
            src_offset += string[src_offset] + 1;
            if (string[src_offset] != 0x00)
            {
                strcat((char*)table->name, ".");
            }
        }
    }
    return src_offset;
}

static void clear_table(NAME_TABLE *table)
{
    memset(table, 0, sizeof(NAME_TABLE));
}

static uint16_t htons(uint16_t data)
{

    uint16_t tmp = 0;
#ifndef __BIG
    tmp  = (data & 0x00ff) << 8;
    tmp  |= (data & 0xff00) >> 8;
    data = tmp;
#endif
    return data;
}

/*****************************************************************************
* Function Name: R_T4_DNS_CLIENT_GetVersion
* Description  : Returns the version of this module. The version number is
*                encoded such that the top two bytes are the major version
*                number and the bottom two bytes are the minor version number.
* Arguments    : none
* Return Value : version number
******************************************************************************/
#pragma inline(R_T4_DNS_CLIENT_GetVersion)
uint32_t  R_T4_DNS_CLIENT_GetVersion(void)
{
    uint32_t const version = (T4_DNS_CLIENT_VERSION_MAJOR << 16) | T4_DNS_CLIENT_VERSION_MINOR;

    return version;
}
